# general iprojetonformation
main_concern = interesse principal
app_title = ObasCId-Tool+ - Gerencie cat\u00e1logos de interesses, identifique e classifique os interesses do seu software...
app_acronym = ObasCId-Tool+
app_name = <i>Ontology for Concerns</i>
app_description = Esta \u00e9 uma aplica\u00e7\u00e3o web para gerenciamento de cat\u00e1logos de interesses, bem como para identifica\u00e7\u00e3o e classifica\u00e7\u00e3o de interesses de software. E pode-se cadastrar e utilizar Pad\u00f5es de Requisitos de Software nas atividade para EROA.
app_author = Paulo Afonso Parreira J\u00fanior
app_author_lattes = http://lattes.cnpq.br/4567261968633725
footer_text = AdvanSE - <i>Advanced Research Group on Software Engineering</i> - <a href="http://www.dc.ufscar.br/" target="_blank">DC</a>/<a href="http://www.ufscar.br/" target="_blank">UFSCar</a>
footer_text_tool = PEQS \u2013 Grupo de Pesquisa em Engenharia de Software da Universidade Federal de Lavras. <a href="http://www.dcc.ufla.br/" target="_blank">DCC</a>/<a href="https://ufla.br/" target="_blank">UFLA</a>
welcome_text = <h1>Bem-vindo</h1><p>Esta \u00e9 uma aplica\u00e7\u00e3o web para gerenciamento de cat\u00e1logos de interesses, bem como para identifica\u00e7\u00e3o e classifica\u00e7\u00e3o de interesses de software. E pode-se cadastrar e utilizar Pad\u00f5es de Requisitos de Software nas atividade para EROA.</p>
logoff_are_you_sure_message = Tem certeza que deseja sair
onto_are_you_sure_message = Tem certeza que deseja remover o cat\u00e1logo de interesses
main_concern_are_you_sure_message = Tem certeza que deseja remover o interesse principal
onto_irreversible_message = Essa a\u00e7\u00e3o n\u00e3o poder\u00e1 ser revertida e todos os interesses relacionados com esse cat\u00e1logo de interesses tamb\u00e9m ser\u00e3o removidos!
proj_are_you_sure_message = Tem certeza que deseja remover o documento de requisitos
req_are_you_sure_message = Tem certeza que deseja remover o requisito
req_irreversible_message = Essa a\u00e7\u00e3o n\u00e3o poder\u00e1 ser revertida e todas as depend\u00eancias relacionadas com esse requisito tamb\u00e9m ser\u00e3o removidas!
proj_irreversible_message = Essa a\u00e7\u00e3o n\u00e3o poder\u00e1 ser revertida e todos os requisitos relacionados com esse documento de requisitos tamb\u00e9m ser\u00e3o removidos!
source_are_you_sure_message = Tem certeza que deseja remover a fonte
ccc_are_you_sure_message = Tem certeza que deseja remover o interesse
iu_are_you_sure_message = Tem certeza que deseja remover a unidade de identifica\u00e7\u00e3o
kw_are_you_sure_message = Tem certeza que deseja remover a palavra-chave
relat_are_you_sure_message = Tem certeza que deseja remover o relacionamento
dependency_are_you_sure_message = Tem certeza que deseja remover a depend\u00eancia
ccc_irreversible_message = Essa a\u00e7\u00e3o n\u00e3o poder\u00e1 ser revertida e todos os dados relacionados com esse interesse, tais como palavras-chave, fontes e relacionamentos, tamb\u00e9m ser\u00e3o removidos!
no_ontologies_message = N\u00e3o h\u00e1 cat\u00e1logos de interesses cadastrados no momento!
no_main_concern_message = N\u00e3o h\u00e1 interesses principais cadastrados para essa unidade de identifica\u00e7\u00e3o no momento!
no_public_ontologies_message = N\u00e3o h\u00e1 cat\u00e1logos de interesses p\u00fablicos cadastrados no momento!
no_public_projects_message = N\u00e3o h\u00e1 documentos de requisitos p\u00fablicos cadastrados no momento!
no_keywords_message = N\u00e3o h\u00e1 palavras-chave cadastradas no momento!
no_sources_message = N\u00e3o h\u00e1 fontes cadastradas no momento!
no_ccc_message = N\u00e3o h\u00e1 interesses cadastrados no momento!
no_projects_message = N\u00e3o h\u00e1 documentos de requisitos cadastrados no momento!
no_relat_message = N\u00e3o h\u00e1 relacionamentos cadastrados no momento!
no_requirements_message = N\u00e3o h\u00e1 requisitos cadastrados no momento!
no_requirement_dependency_message = N\u00e3o h\u00e1 depend\u00eancias cadastradas no momento!
no_iuccc_message = N\u00e3o h\u00e1 interesses a serem selecionados para essa unidade de identifica\u00e7\u00e3o!
no_iuonto_message = N\u00e3o h\u00e1 cat\u00e1logos de interesses a serem selecionados para essa unidade de identifica\u00e7\u00e3o!
no_iu_message = N\u00e3o h\u00e1 unidades de identifica\u00e7\u00e3o cadastradas no momento!
no_contribution_relationships = N\u00e3o h\u00e1 relacionamentos de contribui\u00e7\u00e3o cadastrados no momento!
no_dependency_relationships = N\u00e3o h\u00e1 relacionamentos de depend\u00eancia cadastrados no momento!
select_ccc_message = Por favor, selecione os interesses a serem identificados nesta execu\u00e7\u00e3o!
active_ontology = Cat\u00e1logo de interesses
active_ccc = Interesse
active_project = Documento de Requisitos
choose_ontology_message = Por favor, selecione um cat\u00e1logo de interesses antes de iniciar.
no_enough_ccc = \u00c9 necess\u00e1rio que, no m\u00ednimo, 2 (dois) interesses estejam cadastrados para se criar um relacionamento!
no_enough_req = \u00c9 necess\u00e1rio que, no m\u00ednimo, 2 (dois) requisitos estejam cadastrados para se criar um relacionamento!
no_enough_req_or_ccc = \u00c9 necess\u00e1rio que, no m\u00ednimo, 1 (um) requisito e 1 (um) interesse estejam cadastrados para se definir um interesse principal!
lb_public_license = P\u00fablica
lb_private_license = Privada
lb_nonfunctional_type = N\u00e3o funcional
lb_functional_type = Funcional
lb_main_concern = Interesse principal
lb_crosscutting_concern = Interesse transversal
menu_repositories = Reposit\u00f3rios P\u00fablicos
menu_ontology_repository = Cat\u00e1logos de Interesses P\u00fablicos
menu_project_repository = Documentos de Requisitos P\u00fablicos
menu_home = In\u00edcio
settings_message = As mudan\u00e7as ter\u00e3o efeito ap\u00f3s a pr\u00f3xima inclus\u00e3o de registro cuja configura\u00e7\u00e3o tem impacto.
summary = Resumo
num_of_selected_ccc = Quantidade de interesses selecionados
num_of_identified_ccc = Quantidade de interesses identificados
num_of_affected_requirements = Quantidade de requisitos afetados
num_of_requirements = Quantidade de requisitos
lb_identified_ccc = Interesses identificados
lb_selected_ccc = Interesses selecionados
relationships_matrix_title = Fonte &#10549; / Alvo &#10143;
crosscutting_matrix_title = Interesse principal &#10549; / Entrela\u00e7amentos &#10143;
contribution_matrix_title = Interesse principal &#10549; / Entrela\u00e7amentos &#10143;

# index page information
onto_repo_title = Reposit\u00f3rio de Cat\u00e1logos de Interesses
onto_repo_body = Encontre um ou mais cat\u00e1logos de interesses adequados para seu software.
project_repo_title = Reposit\u00f3rio de Documentos de Requisitos
project_repo_body = Encontre documentos de requisitos que est\u00e3o sendo utilizados para identifica\u00e7\u00e3o de interesses.
mypage_title = Minha P\u00e1gina
mypage_body = Conecte-se a esta rede de pesquisadores interessados na \u00e1rea de identifica\u00e7\u00e3o de interesses interessantes.
mandatory_fields = * Campos de preenchimento obrigat\u00f3rio.
menu_reports = Relat\u00f3rios
menu_general_report = Geral

# single words
word_congratulations = Parab\u00e9ns!
word_choose = Selecione...
word_yes = Sim
word_no = N\u00e3o
word_you = Voc\u00ea

# research menu labels
resmenu_evaluate = Avaliar ObasCId-Tool+
resmenu_update_profile = Meu perfil
resmenu_logoff = Sair
resmenu_settings = Configura\u00e7\u00f5es
resmenu_icons_list = Lista de \u00edcones

# main menu labels
mainmenu_repo = Reposit\u00f3rios
mainmenu_onto_repo = Meus Cat\u00e1logos de Interesses
mainmenu_project_repo = Meus Documentos de Requisitos
mainmenu_about = Sobre
mainmenu_mypage = Minha P\u00e1gina
mainmenu_login = Login
mainmenu_new_researcher = Cadastrar
mainmenu_create_patter = 

# ccc menu labels
cccmenu_kws = Palavras-chave
cccmenu_sources = Fontes

# iu menu labels
iumenu_identified_concerns = Interesses identificados
iumenu_matrixes = Matrizes
iumenu_crosscutting_matrix = Matriz de entrela\u00e7amentos
iumenu_contribution_matrix = Matriz de contribui\u00e7\u00e3o
iumenu_main_concern = Interesse principal

# onto menu labels
ontomenu_ontologies = Cat\u00e1logos de Interesses
ontomenu_ccc = Interesses de Software
ontomenu_keywords = Palavras-chave
ontomenu_relationships = Relacionamentos
ontomenu_dependency = Depend\u00eancia
ontomenu_contribution = Contribui\u00e7\u00e3o
ontomenu_relationships_matrix = Matriz de Relacionamentos

# proj menu labels
projmenu_iu = Unidade de Identifica\u00e7\u00e3o
projmenu_requirements = Requisitos
projmenu_dependencies = Depend\u00eancias
projmenu_iu_exec = Execu\u00e7\u00e3o da Unidade de Identifica\u00e7\u00e3o
projmenu_iu_result = Resultados da Execu\u00e7\u00e3o
projmenu_general_report = Relat\u00f3rio Geral


# button labels
button_clean_filter = Limpar filtro
button_filter = Filtrar requisitos
button_new_main_concern = Novo interesse principal
button_merge = Mesclar cat\u00e1logos
button_search = Pesquisar
button_plain_text = Arquivo de texto
button_login = Entrar
button_read_more = Saiba mais
button_new_ontology = Novo cat\u00e1logo de interesses
button_new_project = Novo documento de requisitos
button_new_requirement = Novo requisito
button_new_pattern = Novo PRS
button_new_requiremet_dependency = Nova depend\u00eancia
button_new_source = Nova fonte
button_new_ccc = Novo interesse
button_new_iu = Nova unidade de identifica\u00e7\u00e3o
button_new_kw = Nova palavra-chave
button_new_relat = Novo relacionamento
button_iu_execution = Executar
button_select_all_ccc = Selecionar todos
button_save = Salvar
button_close = Sair
button_yes = Sim
button_no = N\u00e3o
button_back = Voltar
button_choose_ontology = Selecionar cat\u00e1logo de interesses
button_update_stopwords = Atualizar stopwords
button_import = Importar
button_export = Exportar

# Padr\u00f5es
lb_project_pattern = Utilizar Padr\u00e3o de Requisito
lb_public_select = Selecione
lb_public_create = Cria\u00e7\u00e3o
lb_private_read = Leitura
lb_public_update = Atualiza\u00e7\u00e3o
lb_public_delete = Remo\u00e7\u00e3o
#lb_public_authentication = Autentica\u00e7\u00e3o
#lb_public_authorization = Autoriza\u00e7\u00e3o
#lb_public_logging = Logging
lb_public_storage = Armazenamento
lb_public_security = Seguran\u00e7a
lb_public_performance = Desempenho
lb_public_usability = Usabilidade


# placeholders
ph_email = email@example.com
ph_ontology_search = Procure pelo nome ou descri\u00e7\u00e3o do cat\u00e1logo de interesses
ph_project_search = Procure pelo nome ou descri\u00e7\u00e3o do documento de requisitos

# error messages - general
err_more_than_one_main_concern = Voc\u00ea n\u00e3o pode especificar dois interesses principais para um mesmo requisito!
err_message_title = Ops, algo de errado aconteceu!
warn_message_title = Por favor, observe as mensagens abaixo!
err_same_target_and_source = Um mesmo interese n\u00e3o pode ser fonte e alvo em um relacionamento!
err_dependency_with_same_target_and_source = Um mesmo requisito n\u00e3o pode ser fonte e alvo em uma depend\u00eancia!
err_login = Email ou senha inv\u00e1lidos!
err_confirm_password = As senhas informadas n\u00e3o conferem!
err_stopword = Esta palavra-chave est\u00e1 na lista de stopwords cadastradas para esse pesquisador! 
err_dependency_nonincluded_ccc = Os seguintes interesses est\u00e3o relacionados por depend\u00eancia, por\u00e9m o interesse alvo n\u00e3o foi inclu\u00eddo nesta execu\u00e7\u00e3o
err_dependency_nonidentified_ccc = Ocorr\u00eancia do Tipo II: os seguintes interesses est\u00e3o relacionados por depend\u00eancia, por\u00e9m o interesse alvo n\u00e3o foi identificado no documento de requisitos
err_nonidentified_ccc = N\u00e3o foram identificados interesses para o(s) seguinte(s) requisito(s)
err_nonmainconcern = Ocorr\u00eancia do Tipo I: n\u00e3o foi poss\u00edvel identificar o interesse principal do(s) seguinte(s) requisito(s)
err_pos_contribution_nonincluded_ccc = Os seguintes interesses est\u00e3o relacionados por contribui\u00e7\u00e3o positiva, por\u00e9m o interesse fonte n\u00e3o foi inclu\u00eddo nesta execu\u00e7\u00e3o
err_pos_contribution_nonidentified_ccc = Ocorr\u00eancia do Tipo III: os seguintes interesses est\u00e3o relacionados por contribui\u00e7\u00e3o positiva, por\u00e9m o interesse fonte n\u00e3o foi identificado no documento de requisitos
err_no_selected_ccc = Voc\u00ea deve selecionar pelo menos um interesse para executar uma unidade de identifica\u00e7\u00e3o.
err_pos_contribution_nonincluded = Os seguintes interesses, relacionados por contribui\u00e7\u00e3o positiva, n\u00e3o foram inclu\u00eddos nesta execu\u00e7\u00e3o
err_noncrosscutting_nonfunctionalconcern = Ocorr\u00eancia do Tipo IV: os seguintes interesses n\u00e3o funcionais n\u00e3o contemplam requisitos funcionais do software
err_neg_contribution = Os seguintes interesses est\u00e3o relacionados por contribui\u00e7\u00e3o negativa
err_pos_neg_contribution = O seguinte interesse \u00e9 afetado positivamente e negativamente por interesses distintos
err_lucene = Algo de errado ocorreu com o mecanismo de busca: por favor, entre em contato com o administrador do sistema!

# error messages codes
nonincluded_ccc_code = NIn
nonidentified_ccc_code = NId
pos_neg_contribution_code = PNCont
neg_contribution_code = NCont

# error messages explination
nonincluded_ccc_explanation = voc\u00ea n\u00e3o selecionou algum dos interesses relacionados por depend\u00eancia ou contribui\u00e7\u00e3o positiva durante a execu\u00e7\u00e3o da unidade de identifia\u00e7\u00e3o. Isso pode provocar a n\u00e3o identifica\u00e7\u00e3o de interesses existentes neste software. Para solucionar esse problema, simplesmente adicione esses os intereses faltantes na pr\u00f3xima execu\u00e7\u00e3o da unidade de identifica\u00e7\u00e3o.
nonidentified_ccc_explanation = voc\u00ea selecionou os interesses relacionados por depend\u00eancia ou contribui\u00e7\u00e3o positiva durante a execu\u00e7\u00e3o da unidade de identifica\u00e7\u00e3o, por\u00e9m algum desses interesses n\u00e3o foi identificado nos requisitos do software. Isso pode ter ocorrido devido a: (i) o conjunto de palavras-chave cadastrada para a identifica\u00e7\u00e3o desse interesse est\u00e1 incompleto; (ii) os requisitos do software est\u00e3o omitindo alguma informa\u00e7\u00e3o importante; ou (iii) trata-se de um interesse impl\u00edcito, isto \u00e9, que n\u00e3o encontra-se explicitamente descrito nos requisitos do software. Para resolver esse problema, verifique o conjunto interesses cadastrados, bem como os requisitos do software.
pos_neg_contribution_explanation = h\u00e1 interesses simultaneamente impactados de forma negativa e positiva por outros interesses. Para resolver esse problema, faz-se necess\u00e1ria uma tomada de decis\u00e3o por parte do engenheiro de software sobre qual interesse considerar. Talvez seja preciso agendar reuni\u00f5es com os stakeholders do projeto para isso.
neg_contribution_explanation = h\u00e1 interesses impactados negativamente por outros interesses. Por favor, leve isso em considera\u00e7\u00e3o durante o desenvolvimento do software.

# error messages - required field
err_rf_researcher_name = O campo 'Nome' n\u00e3o pode estar vazio!
err_rf_researcher_email = O campo 'Email' n\u00e3o pode estar vazio!
err_rf_researcher_password = O campo 'Senha' n\u00e3o pode estar vazio!
err_rf_researcher_confirm_password = O campo 'Confirmar Senha' n\u00e3o pode estar vazio!
err_rf_ontology_name = O campo 'Nome do cat\u00e1logo de interesses' n\u00e3o pode estar vazio!
err_rf_source_name = O campo 'Nome da Fonte' n\u00e3o pode estar vazio!
err_rf_ccc_name = O campo 'Nome do Interesse' n\u00e3o pode estar vazio!
err_rf_kw_name = O campo 'Palavra-chave' n\u00e3o pode estar vazio!
err_rf_project_name = O campo 'Nome do documento de requisitos' n\u00e3o pode estar vazio!
err_rf_requirement_desc = O campo 'Descri\u00e7\u00e3o do requisito' n\u00e3o pode estar vazio!
err_rf_requirement_name = O campo 'Nome do requisito' n\u00e3o pode estar vazio!
err_rf_iu_name = O campo 'Nome da unidade de identifica\u00e7\u00e3o' n\u00e3o pode estar vazio!
err_rf_iu_matchingThreshold = O campo 'Threshold do casamento de caracteres' n\u00e3o pode estar vazio!
err_rf_stopwords = O campo 'Stopwords' n\u00e3o pode estar vazio!
err_rf_evaluation_form_url = O campo 'URL do formul\u00e1rio de avalia\u00e7\u00e3o da ferramenta' n\u00e3o pode estar vazio!

# error messages to standard- required field
err_rf_standard_name = O campo 'Nome do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_domain = O campo 'Dom\u00ednio do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_purpose = O campo 'Prop\u00f3sito do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_problem = O campo 'Problema do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_consequence = O campo 'Consequ\u00eancia do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_template = O campo 'Template do padr\u00e3o' n\u00e3o pode estar vazio!
err_rf_standard_related_standards = O campo 'PRS relacionados' n\u00e3o pode estar vazio!

# error messages - duplicated entry
err_de_main_concern = J\u00e1 existe um interesse principal cadastrado com esse par (requisito, interesse)!
err_de_ontology = J\u00e1 existe um cat\u00e1logo de interesses cadastrado com esse nome!
err_de_project = J\u00e1 existe um documento de requisitos cadastrado com esse nome!
err_de_req = J\u00e1 existe um requisito cadastrado com esse nome!
err_de_sta = J\u00e1 existe um padr\u00e3o cadastrado com esse nome!
err_de_source = J\u00e1 existe uma fonte cadastrada com esse nome!
err_de_ccc = J\u00e1 existe um interesse cadastrado com esse nome!
err_de_kw = J\u00e1 existe uma palavra-chave cadastrada com esse nome!
err_de_relat = J\u00e1 existe um relacionamento desse tipo cadastrado com esses interesses fonte e alvo!
err_de_dependency = J\u00e1 existe uma depend\u00eancia cadastrada com esses requisitos fonte e alvo!
err_de_iu = J\u00e1 existe uma unidade de identifica\u00e7\u00e3o cadastrada com esse nome!
err_de_researcher = J\u00e1 existe um pesquisador cadastrado com esse email!

# error constraint exepcetion
err_constraint_exception = H\u00e1 itens que est\u00e3o relacionadas a esse registro. Remova-os antes de excluir o registro.

# page titles
pt_new_filter = Filtrar requisitos
pt_merge_ontologies = Mesclar cat\u00e1logos de interesses
pt_requirement_relationships = Relacionamentos entre requisitos
pt_import_ontology = Importar cat\u00e1logo de interesses
pt_import_project = Importar documento de requisitos
pt_contribution_matrix = Matriz de Contribui\u00e7\u00e3o
pt_crosscutting_matrix = Matriz de entrela\u00e7amentos
pt_dependency_matrix = Matriz de Depend\u00eancia
pt_iu_message_codes = Explica\u00e7\u00e3o dos c\u00f3digos das mensagens
pt_login = Login
pt_icons_list = Lista de \u00edcones
pt_add_researcher = Novo pesquisador
pt_add_main_concern = Novo interesse principal
pt_remove_main_concern = Remover interesse principal
pt_update_source = Atualizar fonte
pt_remove_source = Remover fonte
pt_add_source = Nova fonte
pt_view_source = Visualizar fonte
pt_add_ontology = Novo cat\u00e1logo de interesses
pt_update_ontology = Atualizar cat\u00e1logo de interesses
pt_update_stopwords = Atualizar stopwords
pt_update_profile = Atualizar perfil
pt_view_ontology = Visualizar cat\u00e1logo de interesses
pt_remove_ontology = Remover cat\u00e1logo de interesses
pt_add_project = Novo documento de requisitos
pt_update_project = Atualizar documento de requisitos
pt_view_project = Visualizar documento de requisitos
pt_remove_project = Remover documento de requisitos
pt_add_requirement = Novo requisito
pt_add_pattern = Novo Padr\u00e3o de Requisito de Software
pt_add_requirement_dependency = Nova depend\u00eancia
pt_update_requirement = Atualizar requisito
pt_view_requirement = Visualizar requisito
pt_remove_requirement = Remover requisito
pt_add_ccc = Novo interesse
pt_update_ccc = Atualizar interesse
pt_view_ccc = Visualizar interesse
pt_remove_ccc = Remover interesse
pt_add_iu = Nova unidade de identifica\u00e7\u00e3o
pt_update_iu = Atualizar unidade de identifica\u00e7\u00e3o
pt_view_iu = Visualizar unidade de identifica\u00e7\u00e3o
pt_remove_iu = Remover unidade de identifica\u00e7\u00e3o
pt_add_kw = Nova palavra-chave
pt_update_kw = Atualizar palavra-chave
pt_view_kw = Visualizar palavra-chave
pt_remove_kw = Remover palavra-chave
pt_add_relat = Novo relacionamento
pt_view_relat = Visualizar relacionamento
pt_remove_relat = Remover relacionamento
pt_settings = Configura\u00e7\u00f5es
pt_view_dependency = Visualizar depend\u00eancia
pt_remove_dependency = Remover depend\u00eancia

# add source labels
lb_source_name = Nome da fonte
lb_source_description = Descri\u00e7\u00e3o da fonte
lb_source_type = Tipo da fonte
lb_source_catalogue = Cat\u00e1logo
lb_source_stakeholder = Stakeholder
lb_source_businessdoc = Documento de Neg\u00f3cio

# add researcher labels
lb_researcher_name = Nome do pesquisador
lb_researcher_email = Email 
lb_researcher_password = Senha
lb_researcher_confirm_password = Confirmar senha
lb_researcher_country = Pa\u00eds
lb_researcher_city = Cidade
lb_researcher_state = Estado
lb_researcher_institution = Institui\u00e7\u00e3o

# add ontology labels
lb_ontology_license = Tipo de licen\u00e7a do cat\u00e1logo de interesses
lb_ontology_name = Nome do cat\u00e1logo de interesses
lb_ontology_rename = Novo nome do cat\u00e1logo de interesses
lb_ontology_desc = Descri\u00e7\u00e3o do cat\u00e1logo de interesses
lb_ontology_merge_o1 = Cat\u00e1logo de Interesses 1
lb_ontology_merge_o2 = Cat\u00e1logo de Interesses 2

# add project labels
lb_project_license = Tipo de licen\u00e7a do documento de requisitos
lb_project_name = Nome do documento de requisitos
lb_project_rename = Novo nome do documento de requisitos
lb_project_desc = Descri\u00e7\u00e3o do documento de requisitos

# add requirement labels
lb_requirement_type = Tipo de requisito
lb_requirement_desc = Descri\u00e7\u00e3o do requisito
lb_requirement_name = Nome do requisito
lb_requirement_source = Requisito fonte
lb_requirement_target = Requisito alvo

# add standard labels
lb_standard_name = Nome do padr\u00e3o
lb_standard_domain = Dom\u00ednio do padr\u00e3o
lb_standard_purpose = Prop\u00f3sito do padr\u00e3o
lb_standard_problem = Problema do padr\u00e3o
lb_standard_consequence = Consequ\u00eancia do padr\u00e3o
lb_standard_type = Tipo do padr\u00e3o
lb_standard_template = Template do padr\u00e3o
lb_standard_related_standards = Padr\u00f5es relacionados

# add ccc labels
lb_ccc_name = Nome do Interesse
lb_ccc_desc = Descri\u00e7\u00e3o do Interesse
lb_ccc_type = Tipo de Interesse
lb_ccc_source = Fonte do Interesse
lb_ccc_priority = Prioridade do Interesse
lb_ccc_not_specified_priority = N\u00e3o especificada
lb_ccc_low_priority = Baixa
lb_ccc_medium_priority = M\u00e9dia
lb_ccc_high_priority = Alta

# add iu labels
lb_iu_name = Nome da unidade de identifica\u00e7\u00e3o
lb_iu_ontology = Cat\u00e1logo de interesses a ser utilizado
lb_iu_checkDependencies = Voc\u00ea gostaria de checar depend\u00eancias?
lb_iu_checkContributions = Voc\u00ea gostaria de checar contribui\u00e7\u00f5es?
lb_iu_matchingThreshold = Threshold do casamento de cadeias de caracteres (1.0 para casamento exato)?

# add kw labels
lb_kw_name = Palavra-chave (palavras compostas devem ser escritas entre aspas duplas, por exemplo, "tempo de resposta")
lb_stopwords = Stopwords (separadas por v\u00edrgulas)

# add compo labels
lb_relat_source = Interesse fonte
lb_relat_target = Interess alvo
lb_relat_type = Tipo de relacionamento
lb_relat_dependency_type = Depend\u00eancia
lb_relat_negative_contribution_type = Contribui\u00e7\u00e3o negativa
lb_relat_positive_contribution_type = Contribui\u00e7\u00e3o positiva
lb_relat_meaning = Significado do relacionamento
lb_relat_meaning_dependency = o interesse fonte depende do interesse alvo, e. g, "Cancelamento de Reserva" (fonte) depende de "Cadastramento de Reserva" (alvo).
lb_relat_meaning_pos_contribution = o interesse fonte contribui positivamente para o interesse alvo, e. g, "Concorr\u00eancia" (fonte) contribui positivamente para "Performance" (alvo).
lb_relat_meaning_neg_contribution = o interesse fonte contribui negativamente para o interesse alvo, e. g, "Seguran\u00e7a" (fonte) contribui negativamente para "Performance" (alvo).

# add pattern 
lb_pattern_meaning = Exemplo de Utiliza\u00e7\u00e3o do Padr\u00e3o:
lb_pattern_create = Permitir a inclus\u00e3o de informa\u00e7\u00f5es de cliente, com o armazenamento dos seguintes atributos: c\u00f3digo, nome, endere\u00e7o, bairro e cidade.
lb_pattern_read = Permitir a recupera\u00e7\u00e3o de informa\u00e7\u00e3o de reserva pelo(s) atributo(s) n\u00famero da reserva, durante o processamento da opera\u00e7\u00e3o de venda.
lb_pattern_update = Permitir a altera\u00e7\u00e3o de cliente no(s) seguinte(s) atributo(s): endere\u00e7o e bairro. 
lb_pattern_delete = Permitir a exclus\u00e3o de um registro de cliente desde que n\u00e3o possua nenhuma transa\u00e7\u00e3o vinculado ao mesmo.
#lb_pattern_authentication = Permitir acesso nas funcionalidades de cadastro apenas quando estiver autenticado no sistema.
#lb_pattern_authorization = Permitir acesso nas funcionalidades de apenas quando existir autoriza\u00e7\u00e3o para realizar as tarefas no sistema.
#lb_pattern_logging = Permitir grava\u00e7\u00e3o de Logging na realiza\u00e7\u00e3o de atividades que comprometam o sistema.
lb_pattern_storage = Permitir que a Funcionario seja armazenado em matrizes, banco de dados, arquivos e sendo flex\u00edvel para auxiliar em auditorias.
lb_pattern_security = Permitir acesso \u00e0s funcionalidades de cadastro apenas quando estiver autenticado no sistema ou quando existir autoriza\u00e7\u00e3o para realizar as tarefas no sistema.
lb_pattern_performance = Permitir acesso as funcionalidades do sistema de software de muitos Usuarios ao mesmo tempo, e o tempo de resposta n\u00e3o deve exceder 3 segundos.
lb_pattern_usability = Permitir que o Usuario acesse as interfaces do sistema de software de forma f\u00e1cil, e que tenha manual de ajuda para auxiliar.

# report labels
rp_lb_dependencies = Depende de
rp_lb_ontology = Cat\u00e1logo de Interesses
rp_lb_ccc = Interesses
rp_lb_keywords = Palavras-chave
rp_lb_relationships = Relacionamentos
rp_lb_dependency = Depende de
rp_lb_neg_contribution = Contribui negativamente para
rp_lb_pos_contribution = Contribui positivamente para
rp_lb_sources = Fontes do interesse

# concern identification hints
pt_occurrences_explanation = Explica\u00e7\u00e3o sobre as ocorr\u00eancias
hint_non_main_concern_title = Tipo I: requisito sem interesse principal
hint_non_main_concern_body = <b>Justificativa</b>: cada requisito do software deve estar relacionado a, pelo menos, um interesse principal do software, uma vez que cada requisito \u00e9 escrito com uma finalidade (objetivo).<br/><b>Recomenda\u00e7\u00f5es</b>:<br/>1. Caso o requisito esteja relacionado a pelo menos um interesse, deve-se ent\u00e3o decidir qual deles \u00e9 o seu interesse principal;<br/>2. Caso o requisito n\u00e3o esteja relacionado a qualquer interesse ou caso a lista de interesses identificados para ele n\u00e3o contemple seu interesse principal, recomenda-se:<br/>2.1. Verificar a grafia das palavras-chave, tanto daquelas relacionadas com a descri\u00e7\u00e3o do requisito, quanto daquelas relacionadas ao interesse em quest\u00e3o; <br/>2.2 Verificar a possibilidade de adicionar um novo interesse ao cat\u00e1logo de interesses; <br/>2.3. Verificar a possibilidade de adicionar novas palavras-chave a um interesse pr\u00e9-existente; <br/>2.4. Verificar a possibilidade de reescrever a descri\u00e7\u00e3o do requisito; ou <br/>2.5. Verificar a possibilidade de criar novos relacionamentos de depend\u00eancia deste requisito para outros requisitos de software.
hint_non_identified_concern_title = Tipo II: interesses interdependentes n\u00e3o identificados
hint_non_identified_concern_body = <b>Justificativa</b>: O fato de um interesse "A" depender de outro interesse "B", significa que para que "A" exista no software, "B" tamb\u00e9m deve existir (por exemplo, para haver o interesse "Pagamento", deve haver tamb\u00e9m o interesse "Compra"), assim a identifica\u00e7\u00e3o de "A" e a n\u00e3o identifica\u00e7\u00e3o de "B" implica em um problema que deve ser observado pelo engenheiro de software.<br/><b>Recomenda\u00e7\u00f5es</b>:<br/>1. Verificar a grafia das palavras-chave, tanto daquelas relacionadas com o interesse "B", quanto daquelas relacionadas aos requisitos do software;<br/>2. Verificar a possibilidade de adicionar novas palavras-chave ao interesse "B" , para que o mesmo passe a ser identificado; ou<br/>3. Verificar a possibilidade de reescrever a descri\u00e7\u00e3o de algum requisito do software para que o mesmo passe a ser contemplado pelo interesse "B".
hint_pos_contribution_title = Tipo III: contribui\u00e7\u00e3o positiva n\u00e3o identificada
hint_pos_contribution_body = <b>Justificativa</b>: o fato de um interesse "A" contribuir positivamente para um interesse "B" fornece ind\u00edcios de que se "B" for identificado, "A" tamb\u00e9m deve  ser. Contudo, essa n\u00e3o \u00e9 uma situa\u00e7\u00e3o de erro. Por exemplo, mais de um interesse pode contribuir positivamente para "B" e o engenheiro de software poderia escolher uma ou outra op\u00e7\u00e3o de contribui\u00e7\u00e3o. Mesmo existindo apenas um interesse que contribua positivamente para \u201cB\u201d, n\u00e3o h\u00e1 obrigatoriedade de que esse interesse seja contemplado pelo software. Por exemplo, "Desempenho" e "Padroniza\u00e7\u00e3o" contribuem positivamente para "Usabilidade", por\u00e9m apenas um deles pode ser contemplado no software. Mesmo assim, faz-se necess\u00e1rio gerar uma ocorr\u00eancia de alerta, uma vez que isso pode indicar ao engenheiro de software interesses que ele n\u00e3o havia pensando anteriormente em considerar no software.<br/><b>Recomenda\u00e7\u00f5es</b>:<br/>1. Verificar a grafia das palavras-chave, tanto daquelas relacionadas com o interesse "A", quanto daquelas relacionadas aos requisitos do software;<br/>2. Verificar a possibilidade de adicionar novas palavras-chave ao interesse "A" , para que o mesmo passe a ser identificado;<br/>3. Verificar a possibilidade de reescrever a descri\u00e7\u00e3o de algum requisito do software para que o mesmo passe a ser ontemplado pelo interesse "A"; ou<br/>4. Ignorar a ocorr\u00eancia, pois o interesse "A" realmente n\u00e3o deveria existir no software em an\u00e1lise.
hint_non_crosscutting_nfc_title = Tipo IV: interesses n\u00e3o funcionais sem entrela\u00e7amentos
hint_non_crosscutting_nfc_body = <b>Justificativa</b>: \u00e9 bem conhecido na comunidade cient\u00edfica que interesses n\u00e3o funcionais possuem uma maior tend\u00eancia a serem considerados transversais do que os interesses funcionais. Assim, ao final do processo de identifica\u00e7\u00e3o de interesses, caso haja interesses n\u00e3o funcionais identificados no software que n\u00e3o afetem requisitos funcionais do mesmo, o comportamento transversal desse interesse pode estar sendo omitido. Isso pode ocorrer por diversas raz\u00f5es, sendo uma delas, a especifica\u00e7\u00e3o inadequada dos relacionamentos de depend\u00eancia entre requisitos do software. Esta n\u00e3o \u00e9 uma situa\u00e7\u00e3o de erro, mas serve de alerta ao engenheiro de software para que o mesmo possa verificar se o interesse em quest\u00e3o realmente n\u00e3o possui comportamento transversal.<br/><b>Recomenda\u00e7\u00f5es</b>:<br/>1. Verificar a grafia das palavras-chave, tanto daquelas relacionadas com o interesse "A", quanto daquelas relacionadas aos requisitos do software;<br/>2. Verificar a possibilidade de adicionar novas palavras-chave ao interesse "A", para que o mesmo passe a ser identificado em outros requisitos do software;<br/>3. Verificar a possibilidade de reescrever a descri\u00e7\u00e3o de algum requisito do software para que o mesmo passe a ser contemplado pelo interesse "A";<br/>4. Verificar se os relacionamentos de depend\u00eancia entre os requisitos do software foram corretamente especificados; ou<br/>5. Ignorar a ocorr\u00eancia, pois o interesse "A" realmente n\u00e3o deveria apresentar comportamento transversal no software em an\u00e1lise.

# keyword hints
hint_kw_wildcards_title = Busca com curingas (<i>Wildcards</i>)
hint_kw_wildcards_body =  Os curingas (wildcards) "?" e "*" podem ser utilizados em uma palavra-chave. "?" detecta palavras-chave que se casam com at\u00e9 uma substitui\u00e7\u00e3o de caractere. Exemplo: as palavras-chave "test" e "text" s\u00e3o capturadas pela express\u00e3o "te?t". "*" detecta palavras-chave que cont\u00eam zero ou mais caracteres na posi\u00e7\u00e3o em que o curinga se encontra. Exemplo: as palavras-chave "tests" e "tester", s\u00e3o capturadas pela express\u00e3o  "test*". Esses curingas podem ser utilizados em qualquer posi\u00e7\u00e3o de uma palavra-chave, exceto no seu in\u00edcio.
hint_kw_similarity_title = Busca por similaridade
hint_kw_similarity_body = Palavras-chave similares podem ser encontradas a partir de uma busca por similaridade. Esse tipo de busca utiliza o algoritmo de dist\u00e2ncia de edi\u00e7\u00e3o ou "Levenshtein Distance", que retorna um valor entre 0 e 1, tal que quanto mais pr\u00f3ximo de 1, mais similares s\u00e3o as palavras comparadas. Para utilizar esse recurso, acrescente o s\u00edmbolo "~" no final da palavra-chave desejada, juntamente o <i>threshold</i> exigido para se aceitar uma palavra-chave como similar a outra. Por exemplo, "roam~0.5" ir\u00e1 capturar palavras-chave cujo retorno do algoritmo de dist\u00e2ncia de edi\u00e7\u00e3o seja maior ou igual a 0.5, tal como a palavra "roma".
hint_kw_logic_title = Busca com operadores l\u00f3gicos
hint_kw_logic_body = Os operadores l\u00f3gicos "AND", "OR" e "NOT" s\u00e3o aceitos para constru\u00e7\u00e3o de uma palavra-chave ou do agrupamento de palavras-chave. Por exemplo, "(cancelamento OR cancelar) AND reserva" recupera todos os requisitos que contenham as palavras-chave "cancelamento" OU "cancelar" E a palavra-chave "reserva", simultaneamente. Operadores l\u00f3gicos e curingas podem ser utilizados em conjunto, assim, a palavra-chave anterior poderia ser reescrita como: "cancel* AND reserva".

stopwords = of, the, what, and, from, in, at, on, a, an, for, to, de, a, o, que, e, do, da, em, um, para
evaluation_form = https://goo.gl/OEi18U

hint_execute = Executar
hint_import = Importar
hint_requirement_relationtships = Especificar relacionamentos
hint_update = Editar
hint_remove = Remover
hint_view = Visualizar
hint_public_license = Licen\u00e7a p\u00fablica
hint_private_license = Licen\u00e7a privada
hint_nonfunctional = Recurso n\u00e3o funcional
hint_functional = Recurso funcional
hint_stakeholder_source = Stakeholder
hint_business_document_source = Documento de neg\u00f3cios
hint_catalogue_source = Cat\u00e1logo
hint_not_specified_priority = Prioridade n\u00e3o especificada
hint_low_priority = Prioridade baixa
hint_medium_priority = Prioridade m\u00e9dia
hint_high_priority = Prioridade alta
hint_check_dependencies = Checar depend\u00eancias
hint_check_contributions = Checar contribui\u00e7\u00f5es
hint_getin = Entrar
hint_dependency = Relacionamento de Depend\u00eancia
hint_neg_contribution = Relacionamento de Contribui\u00e7\u00e3o Negativa
hint_pos_contribution = Relacionamento de Contribui\u00e7\u00e3o Positiva
hint_null_relationship = Sem relacionamento
hint_null_crosscutting = Sem entrela\u00e7amento
hint_null_contribution = Sem contribui\u00e7\u00f5es
hint_crosscutting = Entrela\u00e7amento

# default settings
lb_deault_ontology_license = Licen\u00e7a padr\u00e3o para cat\u00e1logos de interesses
lb_deault_project_license = Licen\u00e7a padr\u00e3o para documentos de requisitos
lb_deault_requirement_type = Tipo padr\u00e3o para requisito 
lb_deault_source_type = Tipo padr\u00e3o de fonte
lb_deault_ccc_priority = Prioridade padr\u00e3o para interesses
lb_deault_ccc_type = Tipo padr\u00e3o para interesses
lb_deault_iu_matchingThreshold = Threshold padr\u00e3o para casamento de cadeia de caracteres
lb_deault_relat_type = Tipo padr\u00e3o para relacionamentos entre interesses
lb_default_evaluation_form_url = URL padr\u00e3o para formul\u00e1rio de avalia\u00e7\u00e3o da ferramenta
